import { Component, OnInit } from '@angular/core';
import * as $ from 'jquery'



@Component({
  selector: 'app-read-book',
  templateUrl: './read-book.component.html',
  styleUrls: ['./read-book.component.css']
})
export class ReadBookComponent implements OnInit {

  constructor() { }

  ngOnInit() {
    $(document).ready(function() {
      setTimeout(function() {
        $('.chosen-single span').html($('#select option:selected').html())
        $('.chosen-single div').html('<i class="fa fa-angle-down" aria-hidden="true"></i>')
      },0)
    })
  }

  content: any = `
  <p>&nbsp; &nbsp; มุรากามิ ยูสึเกะเด็กหนุ่มผู้มีปมในใจ ถูกส่งไปยังต่างโลก แถมได้โปรโมชั่นกลายเป็นเทพ จะเกิดอะไรขึ้น เมื่อเด็กหนุ่มคนหนึ่งที่ผ่านการแนะแนวอาชีพเทพ 101 อย่างกระชับสุดๆ แล้วต้องมาเป็นเทพอยู่ในโลกแฟนตาซี ตามติดชีวิตเทพยูสึเกะที่ใช้ชีวิตร่วมกันกับมนุษย์เดินดิน กับความชิวของเหล่าทวยเทพและจอมมาร ตามคำจำกัดความสั้นๆ ตามนิยายเกิดใหม่ต่างโลก สูตรโกง พระเอกเก่ง และ ฮาเร็ม</p>

  <p>&nbsp; &nbsp; มุรากามิ ยูสึเกะเด็กหนุ่มผู้มีปมในใจ ถูกส่งไปยังต่างโลก แถมได้โปรโมชั่นกลายเป็นเทพ จะเกิดอะไรขึ้น เมื่อเด็กหนุ่มคนหนึ่งที่ผ่านการแนะแนวอาชีพเทพ 101 อย่างกระชับสุดๆ แล้วต้องมาเป็นเทพอยู่ในโลกแฟนตาซี ตามติดชีวิตเทพยูสึเกะที่ใช้ชีวิตร่วมกันกับมนุษย์เดินดิน กับความชิวของเหล่าทวยเทพและจอมมาร ตามคำจำกัดความสั้นๆ ตามนิยายเกิดใหม่ต่างโลก สูตรโกง พระเอกเก่ง และ ฮาเร็ม</p>

  <p>&nbsp; &nbsp; มุรากามิ ยูสึเกะเด็กหนุ่มผู้มีปมในใจ ถูกส่งไปยังต่างโลก แถมได้โปรโมชั่นกลายเป็นเทพ จะเกิดอะไรขึ้น เมื่อเด็กหนุ่มคนหนึ่งที่ผ่านการแนะแนวอาชีพเทพ 101 อย่างกระชับสุดๆ แล้วต้องมาเป็นเทพอยู่ในโลกแฟนตาซี ตามติดชีวิตเทพยูสึเกะที่ใช้ชีวิตร่วมกันกับมนุษย์เดินดิน กับความชิวของเหล่าทวยเทพและจอมมาร ตามคำจำกัดความสั้นๆ ตามนิยายเกิดใหม่ต่างโลก สูตรโกง พระเอกเก่ง และ ฮาเร็ม</p>
  `

}
